<summary>terraform plan</summary>

<details>

```tf
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.aws_appautoscaling_policy.app_web_scale_in[0] will be created
  + resource "aws_appautoscaling_policy" "app_web_scale_in" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging_app_web_scale_in_cpu"
      + policy_type        = "StepScaling"
      + resource_id        = "service/staging_app/staging_app_web_service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.app.aws_appautoscaling_policy.app_web_scale_in[1] will be created
  + resource "aws_appautoscaling_policy" "app_web_scale_in" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging_app_web_scale_in_memory"
      + policy_type        = "StepScaling"
      + resource_id        = "service/staging_app/staging_app_web_service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_upper_bound = "0"
              + scaling_adjustment          = -1
            }
        }
    }

  # module.app.aws_appautoscaling_policy.app_web_scale_out[0] will be created
  + resource "aws_appautoscaling_policy" "app_web_scale_out" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging_app_web_scale_out_cpu"
      + policy_type        = "StepScaling"
      + resource_id        = "service/staging_app/staging_app_web_service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.app.aws_appautoscaling_policy.app_web_scale_out[1] will be created
  + resource "aws_appautoscaling_policy" "app_web_scale_out" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "staging_app_web_scale_out_memory"
      + policy_type        = "StepScaling"
      + resource_id        = "service/staging_app/staging_app_web_service"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + step_scaling_policy_configuration {
          + adjustment_type         = "ChangeInCapacity"
          + cooldown                = 300
          + metric_aggregation_type = "Average"

          + step_adjustment {
              + metric_interval_lower_bound = "0"
              + scaling_adjustment          = 1
            }
        }
    }

  # module.app.aws_appautoscaling_target.app_web_scale will be created
  + resource "aws_appautoscaling_target" "app_web_scale" {
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/staging_app/staging_app_web_service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
    }

  # module.app.aws_cloudwatch_metric_alarm.ecs_web_scale_in_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_web_scale_in_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ecs cpu utilization for scale in"
      + alarm_name                            = "staging_app_web_scale_in_cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging_app"
          + "ServiceName" = "staging_app_web_service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_cloudwatch_metric_alarm.ecs_web_scale_in_memory will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_web_scale_in_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ecs memory utilization for scale in"
      + alarm_name                            = "staging_app_web_scale_in_memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging_app"
          + "ServiceName" = "staging_app_web_service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + threshold                             = 30
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_cloudwatch_metric_alarm.ecs_web_scale_out_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_web_scale_out_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ecs cpu utilization for scale out"
      + alarm_name                            = "staging_app_web_scale_out_cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging_app"
          + "ServiceName" = "staging_app_web_service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_cloudwatch_metric_alarm.ecs_web_scale_out_memory will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_web_scale_out_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ecs memory utilization for scale out"
      + alarm_name                            = "staging_app_web_scale_out_memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "ClusterName" = "staging_app"
          + "ServiceName" = "staging_app_web_service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + period                                = 300
      + statistic                             = "Average"
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_ecs_service.app_web will be created
  + resource "aws_ecs_service" "app_web" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:464352955943:cluster/staging_app"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + health_check_grace_period_seconds  = 120
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "staging_app_web_service"
      + platform_version                   = "1.4.0"
      + scheduling_strategy                = "REPLICA"
      + task_definition                    = "arn:aws:ecs:ap-northeast-1:464352955943:task-definition/staging_app_web_task:1"
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "web"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-04ffaf48ae038dfe5",
            ]
          + subnets          = [
              + "subnet-022cd3772623ebe78",
              + "subnet-0f231c56a719070c4",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.app.aws_lb.app_web will be created
  + resource "aws_lb" "app_web" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "staging-app-web"
      + security_groups            = [
          + "sg-06f5e0c4c58b0f868",
        ]
      + subnets                    = [
          + "subnet-00804ce682790c09e",
          + "subnet-091740f069761261c",
        ]
      + tags                       = {
          + "Environment" = "staging"
          + "Name"        = "staging_app_web"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + access_logs {
          + bucket  = "app-logs"
          + enabled = true
          + prefix  = "elb"
        }

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.app.aws_lb_listener.app_web_http will be created
  + resource "aws_lb_listener" "app_web_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.app.aws_lb_target_group.app_web will be created
  + resource "aws_lb_target_group" "app_web" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 0
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "staging-app-web"
      + port                               = 80
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "staging_app_web"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0508efd16eab4a861"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health_check"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 2
          + unhealthy_threshold = 10
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.app.aws_service_discovery_private_dns_namespace.app_web will be created
  + resource "aws_service_discovery_private_dns_namespace" "app_web" {
      + arn         = (known after apply)
      + description = "App Web Service in staging"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "staging_app_web"
      + vpc         = "vpc-0508efd16eab4a861"
    }

  # module.app.aws_service_discovery_service.app_web will be created
  + resource "aws_service_discovery_service" "app_web" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "staging_app_web"
      + namespace_id = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>